config.org

#+TITLE: DT's GNU Emacs Config
#+AUTHOR: Elarbi Msahel
#+DESCRIPTION: DT's personal Emacs config.
#+STARTUP: showeverything
#+OPTIONS: toc:2

* TABLE OF CONTENTS :toc:
- [[#important-programs-to-load-first][IMPORTANT PROGRAMS TO LOAD FIRST]]
  - [[#melpa-package-manager][Melpa Package Manager]]
  - [[#istall-use-package][Istall use package]]
  - [[#load-evil-mode][Load Evil Mode]]
- [[#font][Font]]
- [[#general-keybindings][General Keybindings]]
- [[#graphical-user-interface-tweaks][GRAPHICAL USER INTERFACE TWEAKS]]
  - [[#disable-menubar-toolbars-and-scrollbars][Disable Menubar, Toolbars and Scrollbars]]
  - [[#display-line-numbers-and-truncated-lines][Display Line Numbers and Truncated Lines]]
  - [[#dibale-backup-file][dibale backup file]]
- [[#org-mode][ORG MODE]]
  - [[#enabling-table-of-contents][Enabling Table of Contents]]
  - [[#enabling-org-bullets][Enabling Org Bullets]]
  - [[#org-bullets-gives-us-attractive-bullets-rather-than-asterisks][Org-bullets gives us attractive bullets rather than asterisks.]]
- [[#which-key][WHICH-KEY]]
- [[#close-brackets][close brackets]]
- [[#theme][theme]]
  - [[#icon][icon]]
  - [[#mode-line][mode line]]
- [[#programming-language-config][Programming language config]]
  - [[#web-mode][Web mode]]
  - [[#php-config][php config]]

* IMPORTANT PROGRAMS TO LOAD FIRST
** Melpa Package Manager

#+begin_src emacs-lisp
 (require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
;; Comment/uncomment this line to enable MELPA Stable if desired.  See `package-archive-priorities`
;; and `package-pinned-packages`. Most users will not need or want to do this.
;;(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
(package-initialize)

#+end_src
#+end_src
** Istall use package
#+begin_src emacs-lisp
    (unless (package-installed-p 'use-package)
      (package-install 'use-package))
#+end_src

** Load Evil Mode

#+begin_src emacs-lisp
 
#+end_src

* Font

#+begin_src emacs-lisp
    (set-face-attribute 'default nil
    :font "JetBrains Mono"
    :height 130
    :weight 'medium)
  (set-face-attribute 'variable-pitch nil
    :font "Consolas"
    :height 120
    :weight 'medium)
  (set-face-attribute 'fixed-pitch nil
    :font "JetBrains Mono"
    :height 130
    :weight 'medium)
  ;; Makes commented text and keywords italics.
  ;; This is working in emacsclient but not emacs.
  ;; Your font must have an italic face available.
  (set-face-attribute 'font-lock-comment-face nil
    :slant 'italic)
  (set-face-attribute 'font-lock-keyword-face nil
    :slant 'italic)
  
  (setq-default tab-width 2)

  (global-set-key (kbd "C-d") 'fdx/duplicate-line)
  (global-set-key (kbd "C-c c") 'kill-ring-save)
  (global-set-key (kbd "C-c v") 'yank)
  (global-set-key (kbd "C-c x") 'kill)


#+end_src


* GRAPHICAL USER INTERFACE TWEAKS
Let's make GNU Emacs look a little better.

** Disable Menubar, Toolbars and Scrollbars
#+begin_src emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
#+end_src

** Display Line Numbers and Truncated Lines
#+begin_src emacs-lisp
(global-display-line-numbers-mode 1)
(global-visual-line-mode t)
#+end_src
** dibale backup file

#+begin_src emacs-lisp
(setq make-backup-files nil)
#+end_src

* ORG MODE
** Enabling Table of Contents
#+begin_src emacs-lisp
  (use-package toc-org
      :commands toc-org-enable
      :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

** Enabling Org Bullets
** Org-bullets gives us attractive bullets rather than asterisks.

#+begin_src emacs-lisp
  (add-hook 'org-mode-hook 'org-indent-mode)
  (use-package org-bullets)
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src

* IVY MODE

#+begin_src emacs-lisp
  (use-package counsel
  :after ivy
  :config (counsel-mode))
  (ivy-mode)
  (setq ivy-use-virtual-buffers t)
  (setq enable-recursive-minibuffers t)
  ;; enable this if you want `swiper' to use it
  ;; (setq search-default-mode #'char-fold-to-regexp)
  (global-set-key "\C-s" 'swiper)
  (global-set-key (kbd "C-c C-r") 'ivy-resume)
  (global-set-key (kbd "<f6>") 'ivy-resume)
  (global-set-key (kbd "M-x") 'counsel-M-x)
  (global-set-key (kbd "C-x C-f") 'counsel-find-file)
  (global-set-key (kbd "<f1> f") 'counsel-describe-function)
  (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
  (global-set-key (kbd "<f1> o") 'counsel-describe-symbol)
  (global-set-key (kbd "<f1> l") 'counsel-find-library)
  (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
  (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
  (global-set-key (kbd "C-c g") 'counsel-git)
  (global-set-key (kbd "C-c j") 'counsel-git-grep)
  (global-set-key (kbd "C-c k") 'counsel-ag)
  (global-set-key (kbd "C-x l") 'counsel-locate)
  (global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
  (define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history)

#+end_src

* Projectile Config
** projectile use
#+begin_src emacs-lisp
(use-package projectile )  
(projectile-mode +1)
;; Recommended keymap prefix on macOS
(define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
;; Recommended keymap prefix on Windows/Linux
(define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
#+end_src

* WHICH-KEY
#+begin_src emacs-lisp
  (use-package which-key
    :ensure t)
  (which-key-mode)
#+end_src

* close brackets
#+begin_src emacs-lisp
(electric-pair-mode 1)
#+end_src
* theme
** icon
#+begin_src
  (when (display-graphic-p)
  (require 'all-the-icons))
  ;; or
  (use-package all-the-icons
  :if (display-graphic-p))

#+end_src
** mode line
#+begin_src emacs-lisp
  (use-package doom-themes
    :ensure t)
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t)
  (load-theme 'doom-solarized-light t)
  (use-package doom-modeline
    :ensure t)
  (doom-modeline-mode 1)
  (setq display-line-numbers-type 'normal)
#+end_src

* Programming language config

** Web mode
#+begin_src emacs-lisp
  (require 'web-mode)
  (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
#+end_src
** php config
#+begin_src emacs-lisp
  (ac-config-default)
#+end_src
